---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathCannotBeClosedLoop
source: html/0ddc5647-23df-8814-c388-7dca2ae865d5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.PathCannotBeClosedLoop Property

Path cannot be a closed loop.

## Syntax (C#)
```csharp
public static FailureDefinitionId PathCannotBeClosedLoop { get; }
```